---
kind: enumMember
id: F:Autodesk.Revit.DB.BackgroundImageFit.Horizontal
enum: Autodesk.Revit.DB.BackgroundImageFit
source: html/7948e97e-d74a-3b6a-e2fd-eb82bfdac7f0.htm
---
# Autodesk.Revit.DB.BackgroundImageFit.Horizontal

The image is proportionally resized so its width matches the view's width.